ProjectPokimon/app/controllers/members_controller.rb

  def show
    @pokemon = PokimonName.find(params[:id])
---
SELECT "pokimon_names".* FROM "pokimon_names" WHERE "pokimon_names"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]