ProjectPokimon/app/controllers/pokemons_controller.rb

SELECT "pokimon_names".* FROM "pokimon_names" WHERE (name LIKE '%Pi%') LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT "pokimon_names".* FROM "pokimon_names"
SELECT COUNT(*) FROM "pokimon_names"
---
  def index
    if params[:search].present?
      @pokemons = PokimonName.where("name LIKE ?", "%#{params[:search]}%").page(params[:page]).per(15)
    else
      @pokemons = PokimonName.page(params[:page]).per(15)